// BCS পরীক্ষার OMR sheet ডিজিটালভাবে চেক করা হয়। এটা right, wrong, missed সব কটি গণনা করতে পারে, কিন্তু ফাইনাল স্কোর বের করতে পারে না। তোমার কাজ হলো একটি ফাংশন বানানো যা Object নেবে এবং ফাইনাল স্কোর ক্যালকুলেট করবে।
// ফাংশনের কাজ: ফাংশনটি ইনপুট হিসেবে একটি Object নেবে এবং নিচের শর্ত ও নিয়ম অনুযায়ী ফলাফল প্রদান করবে।
// 📥 Input:
// একটি Object যার প্রপার্টিগুলো হবে: { right: Number, wrong: Number, skip: Number }
// Output :  ফাইনাল স্কোর হবে নাম্বার এবং রাউন্ডেড। (Number, Rounded)  

// 🎯 BCS পরীক্ষার নিয়ম:
// মোট প্রশ্ন সংখ্যা = ১০০টি।
// সুতরাং, ইনপুটে থাকা right + wrong + skip এর যোগফল অবশ্যই ১০০ হতে হবে।

// 🚩 Challenge:
// যদি right + wrong + skip এর যোগফল ১০০ না হয়, তবে আউটপুট হিসেবে Invalid রিটার্ন করতে হবে।

// 💡 Scoring Rules:
// প্রতিটি সঠিক উত্তরের জন্য: +১ পয়েন্ট।
// প্রতিটি ভুল উত্তরের জন্য: -০.৫ পয়েন্ট (০.৫ নম্বর কাটা যাবে)।
// বাদ দেওয়া (skip) প্রশ্নের জন্য: ০ পয়েন্ট।

function finalScore(omr) {
    let forRight = 0;
    let forWrong = 0;
    for (let prop in omr) {
        //  console.log(omr[prop]);
        if (prop === "right") {
             forRight = omr[prop]* 1; 
        }
        if (prop === "wrong") {
            forWrong =omr[prop]* -0.5;
        }
        if (prop === "skip") {
            continue;
        }
    }
    let questions = Object.values(omr);
    let sum = 0;
    for (let question of questions) {
        sum += question;
    }
    if (sum !== 100) {
        return "Invalid"
    }
    let total = forRight + forWrong;
    return Math.round(total);
}

// finalScore({ "right": 67, "wrong": 23, "skip": 10 })
let output = finalScore({ "right": 67, "wrong": 23, "skip": 10 });
console.log(output);