// Problem-04: Upcoming Gono Vote
// ⚠️ Function Name Must be gonoVote()
// আসন্ন গণভোটের ফলাফল বিশ্লেষণের জন্য তোমাকে একটি দায়িত্ব দেওয়া হয়েছে। ভোটের ডাটাগুলো একটি Array-তে জমা করা হয়েছে যেখানে ভোটারদের মতামত "ha" অথবা "na" হিসেবে আছে। তোমার কাজ হলো একটি ফাংশন তৈরি করা যা ভোট গণনা করবে এবং দেখবে "ha" ভোট সংখ্যাগরিষ্ঠ (Majority) কি না।
// ফাংশনের কাজ: ফাংশনটি ইনপুট হিসেবে একটি Array নেবে এবং ভোটের সংখ্যার ওপর ভিত্তি করে একটি Boolean (true/false) অথবা equal (string) রিটার্ন করবে।
// 📥 Input:
// ইনপুট হবে একটি Array। যেমন: ["ha", "na", "ha"]

// 🚀 Output:
// যদি "ha" সংখ্যা "na" এর বেশি → true
// যদি "ha" সংখ্যা "na" এর সমান → “equal”
// অন্যথায় → false

// 🚩 Challenge:
// যদি ইনপুটটি একটি Array না হয় (যেমন: String, Number বা Object), তবে আউটপুট হিসেবে Invalid রিটার্ন করতে হবে।

function gonoVote(array) {
    if (Array.isArray(array) !== true) {
        return "invalid"
    }
    let voteCount = {};
    for (let vote of array) {
        if (voteCount.hasOwnProperty(vote)) {
            voteCount[vote] += 1;
        }
        else {
            voteCount[vote] = 1;
        }
        // } console.log(voteCount);
    }
            if (voteCount["ha"] > voteCount["na"]) {
            return true;
        }
        if (voteCount["ha"] === voteCount["na"]) {
            return "equal"
        }
        else {
            return false;
        }
}
let output = gonoVote(["ha","ha" ,"ha", "na", "na"]);
console.log(output);